Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025daa288.h
extern volatile __EMACxCLRTbits_t EMACxCLRTbits __asm__ ("EMACxCLRT") __attribute__((section("sfrs"), address(0xBF882240)));
extern volatile uint32_t        EMAC1CLRTCLR __attribute__((section("sfrs"),address(0xBF882244)));
extern volatile uint32_t        EMACxCLRTCLR __attribute__((section("sfrs"),address(0xBF882244)));
extern volatile uint32_t        EMAC1CLRTSET __attribute__((section("sfrs"),address(0xBF882248)));
extern volatile uint32_t        EMACxCLRTSET __attribute__((section("sfrs"),address(0xBF882248)));
extern volatile uint32_t        EMAC1CLRTINV __attribute__((section("sfrs"),address(0xBF88224C)));
extern volatile uint32_t        EMACxCLRTINV __attribute__((section("sfrs"),address(0xBF88224C)));
#define EMAC1MAXF EMAC1MAXF
extern volatile uint32_t   EMAC1MAXF __attribute__((section("sfrs"), address(0xBF882250)));
typedef union {
  struct {
    uint32_t MACMAXF:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MAXFbits_t;
extern volatile __EMAC1MAXFbits_t EMAC1MAXFbits __asm__ ("EMAC1MAXF") __attribute__((section("sfrs"), address(0xBF882250)));
#define EMACxMAXF EMACxMAXF
extern volatile uint32_t   EMACxMAXF __attribute__((section("sfrs"), address(0xBF882250)));
typedef union {
  struct {
    uint32_t MACMAXF:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMAXFbits_t;
extern volatile __EMACxMAXFbits_t EMACxMAXFbits __asm__ ("EMACxMAXF") __attribute__((section("sfrs"), address(0xBF882250)));
extern volatile uint32_t        EMAC1MAXFCLR __attribute__((section("sfrs"),address(0xBF882254)));
extern volatile uint32_t        EMACxMAXFCLR __attribute__((section("sfrs"),address(0xBF882254)));
extern volatile uint32_t        EMAC1MAXFSET __attribute__((section("sfrs"),address(0xBF882258)));
extern volatile uint32_t        EMACxMAXFSET __attribute__((section("sfrs"),address(0xBF882258)));
extern volatile uint32_t        EMAC1MAXFINV __attribute__((section("sfrs"),address(0xBF88225C)));
extern volatile uint32_t        EMACxMAXFINV __attribute__((section("sfrs"),address(0xBF88225C)));
#define EMAC1SUPP EMAC1SUPP
extern volatile uint32_t   EMAC1SUPP __attribute__((section("sfrs"), address(0xBF882260)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SPEEDRMII:1;
    uint32_t :2;
    uint32_t RESETRMII:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SUPPbits_t;
extern volatile __EMAC1SUPPbits_t EMAC1SUPPbits __asm__ ("EMAC1SUPP") __attribute__((section("sfrs"), address(0xBF882260)));
#define EMACxSUPP EMACxSUPP
extern volatile uint32_t   EMACxSUPP __attribute__((section("sfrs"), address(0xBF882260)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SPEEDRMII:1;
    uint32_t :2;
    uint32_t RESETRMII:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSUPPbits_t;
extern volatile __EMACxSUPPbits_t EMACxSUPPbits __asm__ ("EMACxSUPP") __attribute__((section("sfrs"), address(0xBF882260)));
extern volatile uint32_t        EMAC1SUPPCLR __attribute__((section("sfrs"),address(0xBF882264)));
extern volatile uint32_t        EMACxSUPPCLR __attribute__((section("sfrs"),address(0xBF882264)));
extern volatile uint32_t        EMAC1SUPPSET __attribute__((section("sfrs"),address(0xBF882268)));
extern volatile uint32_t        EMACxSUPPSET __attribute__((section("sfrs"),address(0xBF882268)));
extern volatile uint32_t        EMAC1SUPPINV __attribute__((section("sfrs"),address(0xBF88226C)));
extern volatile uint32_t        EMACxSUPPINV __attribute__((section("sfrs"),address(0xBF88226C)));
#define EMAC1TEST EMAC1TEST
extern volatile uint32_t   EMAC1TEST __attribute__((section("sfrs"), address(0xBF882270)));
typedef union {
  struct {
    uint32_t SHRTQNTA:1;
    uint32_t TESTPAUSE:1;
    uint32_t TESTBP:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1TESTbits_t;
extern volatile __EMAC1TESTbits_t EMAC1TESTbits __asm__ ("EMAC1TEST") __attribute__((section("sfrs"), address(0xBF882270)));
#define EMACxTEST EMACxTEST
extern volatile uint32_t   EMACxTEST __attribute__((section("sfrs"), address(0xBF882270)));
typedef union {
  struct {
    uint32_t SHRTQNTA:1;
    uint32_t TESTPAUSE:1;
    uint32_t TESTBP:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxTESTbits_t;
extern volatile __EMACxTESTbits_t EMACxTESTbits __asm__ ("EMACxTEST") __attribute__((section("sfrs"), address(0xBF882270)));
extern volatile uint32_t        EMAC1TESTCLR __attribute__((section("sfrs"),address(0xBF882274)));
extern volatile uint32_t        EMACxTESTCLR __attribute__((section("sfrs"),address(0xBF882274)));
extern volatile uint32_t        EMAC1TESTSET __attribute__((section("sfrs"),address(0xBF882278)));
extern volatile uint32_t        EMACxTESTSET __attribute__((section("sfrs"),address(0xBF882278)));
extern volatile uint32_t        EMAC1TESTINV __attribute__((section("sfrs"),address(0xBF88227C)));
extern volatile uint32_t        EMACxTESTINV __attribute__((section("sfrs"),address(0xBF88227C)));
#define EMAC1MCFG EMAC1MCFG
extern volatile uint32_t   EMAC1MCFG __attribute__((section("sfrs"), address(0xBF882280)));
typedef union {
  struct {
    uint32_t SCANINC:1;
    uint32_t NOPRE:1;
    uint32_t CLKSEL:4;
    uint32_t :9;
    uint32_t RESETMGMT:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MCFGbits_t;
extern volatile __EMAC1MCFGbits_t EMAC1MCFGbits __asm__ ("EMAC1MCFG") __attribute__((section("sfrs"), address(0xBF882280)));
#define EMACxMCFG EMACxMCFG
extern volatile uint32_t   EMACxMCFG __attribute__((section("sfrs"), address(0xBF882280)));
typedef union {
  struct {
    uint32_t SCANINC:1;
    uint32_t NOPRE:1;
    uint32_t CLKSEL:4;
    uint32_t :9;
    uint32_t RESETMGMT:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMCFGbits_t;
extern volatile __EMACxMCFGbits_t EMACxMCFGbits __asm__ ("EMACxMCFG") __attribute__((section("sfrs"), address(0xBF882280)));
extern volatile uint32_t        EMAC1MCFGCLR __attribute__((section("sfrs"),address(0xBF882284)));
extern volatile uint32_t        EMACxMCFGCLR __attribute__((section("sfrs"),address(0xBF882284)));
extern volatile uint32_t        EMAC1MCFGSET __attribute__((section("sfrs"),address(0xBF882288)));
extern volatile uint32_t        EMACxMCFGSET __attribute__((section("sfrs"),address(0xBF882288)));
extern volatile uint32_t        EMAC1MCFGINV __attribute__((section("sfrs"),address(0xBF88228C)));
extern volatile uint32_t        EMACxMCFGINV __attribute__((section("sfrs"),address(0xBF88228C)));
#define EMAC1MCMD EMAC1MCMD
extern volatile uint32_t   EMAC1MCMD __attribute__((section("sfrs"), address(0xBF882290)));
typedef union {
  struct {
    uint32_t READ:1;
    uint32_t SCAN:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MCMDbits_t;
extern volatile __EMAC1MCMDbits_t EMAC1MCMDbits __asm__ ("EMAC1MCMD") __attribute__((section("sfrs"), address(0xBF882290)));
#define EMACxMCMD EMACxMCMD
extern volatile uint32_t   EMACxMCMD __attribute__((section("sfrs"), address(0xBF882290)));
typedef union {
  struct {
    uint32_t READ:1;
    uint32_t SCAN:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMCMDbits_t;
