Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025daa288.h
#define _DDRODTCFG_ODTCSEN_POSITION              0x00000000
#define _DDRODTCFG_ODTCSEN_MASK                  0x000000FF
#define _DDRODTCFG_ODTCSEN_LENGTH                0x00000008

#define _DDRODTCFG_ODTRDLY_POSITION              0x00000008
#define _DDRODTCFG_ODTRDLY_MASK                  0x00000F00
#define _DDRODTCFG_ODTRDLY_LENGTH                0x00000004

#define _DDRODTCFG_ODTWDLY_POSITION              0x0000000C
#define _DDRODTCFG_ODTWDLY_MASK                  0x0000F000
#define _DDRODTCFG_ODTWDLY_LENGTH                0x00000004

#define _DDRODTCFG_ODTRLEN_POSITION              0x00000010
#define _DDRODTCFG_ODTRLEN_MASK                  0x00070000
#define _DDRODTCFG_ODTRLEN_LENGTH                0x00000003

#define _DDRODTCFG_ODTWLEN_POSITION              0x00000014
#define _DDRODTCFG_ODTWLEN_MASK                  0x00700000
#define _DDRODTCFG_ODTWLEN_LENGTH                0x00000003

#define _DDRXFERCFG_NXTDATRQDLY_POSITION         0x00000000
#define _DDRXFERCFG_NXTDATRQDLY_MASK             0x0000000F
#define _DDRXFERCFG_NXTDATRQDLY_LENGTH           0x00000004

#define _DDRXFERCFG_NXTDATAVDLY_POSITION         0x00000004
#define _DDRXFERCFG_NXTDATAVDLY_MASK             0x000000F0
#define _DDRXFERCFG_NXTDATAVDLY_LENGTH           0x00000004

#define _DDRXFERCFG_RDATENDLY_POSITION           0x00000010
#define _DDRXFERCFG_RDATENDLY_MASK               0x000F0000
#define _DDRXFERCFG_RDATENDLY_LENGTH             0x00000004

#define _DDRXFERCFG_MAXBURST_POSITION            0x00000018
#define _DDRXFERCFG_MAXBURST_MASK                0x0F000000
#define _DDRXFERCFG_MAXBURST_LENGTH              0x00000004

#define _DDRXFERCFG_BIGENDIAN_POSITION           0x0000001F
#define _DDRXFERCFG_BIGENDIAN_MASK               0x80000000
#define _DDRXFERCFG_BIGENDIAN_LENGTH             0x00000001

#define _DDRCMDISSUE_NUMHOSTCMDS_POSITION        0x00000000
#define _DDRCMDISSUE_NUMHOSTCMDS_MASK            0x0000000F
#define _DDRCMDISSUE_NUMHOSTCMDS_LENGTH          0x00000004

#define _DDRCMDISSUE_VALID_POSITION              0x00000004
#define _DDRCMDISSUE_VALID_MASK                  0x00000010
#define _DDRCMDISSUE_VALID_LENGTH                0x00000001

#define _DDRODTENCFG_ODTREN_POSITION             0x00000000
#define _DDRODTENCFG_ODTREN_MASK                 0x00000001
#define _DDRODTENCFG_ODTREN_LENGTH               0x00000001

#define _DDRODTENCFG_ODTWEN_POSITION             0x00000010
#define _DDRODTENCFG_ODTWEN_MASK                 0x00010000
#define _DDRODTENCFG_ODTWEN_LENGTH               0x00000001

#define _DDRMEMWIDTH_HALFRATE_POSITION           0x00000003
#define _DDRMEMWIDTH_HALFRATE_MASK               0x00000008
#define _DDRMEMWIDTH_HALFRATE_LENGTH             0x00000001

#define _DDRCMD10_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD10_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD10_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD10_CSCMD1_POSITION                0x00000001
#define _DDRCMD10_CSCMD1_MASK                    0x000001FE
#define _DDRCMD10_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD10_RASCMD1_POSITION               0x00000009
#define _DDRCMD10_RASCMD1_MASK                   0x00000200
#define _DDRCMD10_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD10_CASCMD1_POSITION               0x0000000A
#define _DDRCMD10_CASCMD1_MASK                   0x00000400
#define _DDRCMD10_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD10_WENCMD1_POSITION               0x0000000B
#define _DDRCMD10_WENCMD1_MASK                   0x00000800
#define _DDRCMD10_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD10_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD10_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD10_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD10_CSCMD2_POSITION                0x0000000D
#define _DDRCMD10_CSCMD2_MASK                    0x001FE000
#define _DDRCMD10_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD10_RASCMD2_POSITION               0x00000015
#define _DDRCMD10_RASCMD2_MASK                   0x00200000
#define _DDRCMD10_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD10_CASCMD2_POSITION               0x00000016
#define _DDRCMD10_CASCMD2_MASK                   0x00400000
#define _DDRCMD10_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD10_WENCMD2_POSITION               0x00000017
#define _DDRCMD10_WENCMD2_MASK                   0x00800000
#define _DDRCMD10_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD10_MDALCMD_POSITION               0x00000018
#define _DDRCMD10_MDALCMD_MASK                   0xFF000000
#define _DDRCMD10_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD11_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD11_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD11_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD11_CSCMD1_POSITION                0x00000001
#define _DDRCMD11_CSCMD1_MASK                    0x000001FE
#define _DDRCMD11_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD11_RASCMD1_POSITION               0x00000009
#define _DDRCMD11_RASCMD1_MASK                   0x00000200
#define _DDRCMD11_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD11_CASCMD1_POSITION               0x0000000A
#define _DDRCMD11_CASCMD1_MASK                   0x00000400
#define _DDRCMD11_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD11_WENCMD1_POSITION               0x0000000B
#define _DDRCMD11_WENCMD1_MASK                   0x00000800
#define _DDRCMD11_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD11_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD11_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD11_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD11_CSCMD2_POSITION                0x0000000D
#define _DDRCMD11_CSCMD2_MASK                    0x001FE000
#define _DDRCMD11_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD11_RASCMD2_POSITION               0x00000015
#define _DDRCMD11_RASCMD2_MASK                   0x00200000
#define _DDRCMD11_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD11_CASCMD2_POSITION               0x00000016
#define _DDRCMD11_CASCMD2_MASK                   0x00400000
#define _DDRCMD11_CASCMD2_LENGTH                 0x00000001

